
## Plan Result (ecs_practice/terraform)

[CI link](https://github.com/harayu-k/infra_sandbox/actions/runs/12734390760)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 11 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * aws_route_table.this[&#34;app&#34;]
  * aws_route_table.this[&#34;db&#34;]
  * aws_route_table.this[&#34;ingress&#34;]
  * aws_route_table_association.this[&#34;app_private_app_1a&#34;]
  * aws_route_table_association.this[&#34;app_private_app_1c&#34;]
  * aws_route_table_association.this[&#34;db_private_db_1a&#34;]
  * aws_route_table_association.this[&#34;db_private_db_1c&#34;]
  * aws_route_table_association.this[&#34;ingress_public_ingress_1a&#34;]
  * aws_route_table_association.this[&#34;ingress_public_ingress_1c&#34;]
  * aws_route_table_association.this[&#34;ingress_public_management_1a&#34;]
  * aws_route_table_association.this[&#34;ingress_public_management_1c&#34;]
* Delete
  * aws_route_table.example


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_route_table.example will be destroyed
  # (because aws_route_table.example is not in configuration)
  - resource "aws_route_table" "example" {
      - arn              = "arn:aws:ec2:ap-northeast-1:992382441056:route-table/rtb-08166ed31f5c97d09" -> null
      - id               = "rtb-08166ed31f5c97d09" -> null
      - owner_id         = "992382441056" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - cidr_block                 = "0.0.0.0/0"
              - gateway_id                 = "igw-02f70bef3ab40bbc1"
                # (11 unchanged attributes hidden)
            },
        ] -> null
      - tags             = {
          - "Name" = "main"
        } -> null
      - tags_all         = {
          - "Managed" = "Terraform"
          - "Name"    = "main"
        } -> null
      - vpc_id           = "vpc-09b0c706d486d2aeb" -> null
    }

  # aws_route_table.this["app"] will be created
  + resource "aws_route_table" "this" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "app"
        }
      + tags_all         = {
          + "Managed" = "Terraform"
          + "Name"    = "app"
        }
      + vpc_id           = "vpc-09b0c706d486d2aeb"
    }

  # aws_route_table.this["db"] will be created
  + resource "aws_route_table" "this" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "db"
        }
      + tags_all         = {
          + "Managed" = "Terraform"
          + "Name"    = "db"
        }
      + vpc_id           = "vpc-09b0c706d486d2aeb"
    }

  # aws_route_table.this["ingress"] will be created
  + resource "aws_route_table" "this" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = "igw-02f70bef3ab40bbc1"
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "ingress"
        }
      + tags_all         = {
          + "Managed" = "Terraform"
          + "Name"    = "ingress"
        }
      + vpc_id           = "vpc-09b0c706d486d2aeb"
    }

  # aws_route_table_association.this["app_private_app_1a"] will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-0c6e62a6d5730715f"
    }

  # aws_route_table_association.this["app_private_app_1c"] will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-03ce245afed54dd38"
    }

  # aws_route_table_association.this["db_private_db_1a"] will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-015dfa7d35acfa633"
    }

  # aws_route_table_association.this["db_private_db_1c"] will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-0f47daefe06401be8"
    }

  # aws_route_table_association.this["ingress_public_ingress_1a"] will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-0e08cb0bbe084719c"
    }

  # aws_route_table_association.this["ingress_public_ingress_1c"] will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-0b3a48f92d667ffc1"
    }

  # aws_route_table_association.this["ingress_public_management_1a"] will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-0390a8a4763d9c950"
    }

  # aws_route_table_association.this["ingress_public_management_1c"] will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-0b4dbc3e2c147c86e"
    }

Plan: 11 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":15,"Program":"tfcmt","SHA1":"49d2ee16bafc7126266f09dfd0d7e12590040149","Target":"ecs_practice/terraform","Vars":{},"WorkflowName":"terraform-plan"} -->